# Obtener y conocer sus datos



### Ej 1. Importar las bibliotecas necesarias

In [2]:
import numpy as np
import pandas as pd

### Ej 2. Importar el conjunto de datos desde esta [url](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user) y asignarlo a una variable llamada usuarios y utilizar el 'user_id' como índice

In [3]:
#Para que los datos queden separados en columnas, visualmente mas claro usamos sep
usuarios=pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",sep='|')
usuarios

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [4]:
#Indicamos que los indices son los de la columna user_id
#En este caso los datos vienen separados por un |, por tanto para separarlo por la barra 
usuarios=pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",sep='|', index_col='user_id')
usuarios

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [7]:
usuarios=pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",sep='|')
usuarios=usuarios.set_index('user_id')
usuarios

KeyboardInterrupt:

In [8]:
usuarios.head() #Para mostrar los primeros datos

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Ej 3. Ver las primeras 25 entradas

In [9]:
usuarios.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [21]:
usuarios.loc[:25:,::]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Ej 4. Ver las primeras 25 entradas de una forma diferente

In [27]:
usuarios[0:25] #va desde el 0 hasta el n

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Ej 5. Ver las últimas 10 entradas

In [29]:
usuarios[-10:]

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [10]:
usuarios.tail(10) #tail muestra las ultimas entradas

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Ej 6. ¿Cuál es el número de observaciones en el conjunto de datos?
Resuélvelo de 2 maneras diferentes.

In [40]:
#Numero de observaciones= numero de filas.
#Comos los indices estan numerados el ultimo sera el numero total de filas
usuarios.index[-1]

943

In [11]:
len(usuarios)

943

In [42]:
print(usuarios.shape) #(numero de filas,numero de columnas)

#como queremos el numero de filas
print(usuarios.shape[0])

(943, 4)
943

In [13]:
print(usuarios.size) #Muestra el total de todos

3772

In [18]:
usuarios.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### Ej 7. ¿Cuál es el número de columnas en el conjunto de datos?
Resuélvelo de 2 maneras diferentes.

In [43]:
#Numero de columnas
usuarios.shape[1]

4

In [15]:
col=usuarios.columns
print(len(col))

4

In [47]:
count=0
for x in usuarios.keys():
    count+=1

count

4

### Ej 8. Imprima el nombre de todas las columnas.

In [21]:
usuarios.keys() #Imprime el nombre se las columnas

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [19]:
usuarios.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Ej 9. ¿Cómo se indexa el conjunto de datos? Obtener los valores del índice.

In [49]:
valores_indice=usuarios.index
valores_indice

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

### Ej 10. ¿Cuál es el tipo de datos de cada columna?
Resuélvelo de 2 maneras diferentes.

In [50]:
usuarios

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [22]:
usuarios.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [24]:
usuarios.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [53]:
for columna in usuarios.keys():
    print(usuarios[columna].dtype)

int64
object
object
object

In [59]:
for columna in usuarios.columns:
    print(usuarios[columna].dtype)

int64
object
object
object

### Ej 11. Imprime solo la columna de ocupación
Resuélvelo de 2 maneras diferentes.

In [56]:
usuarios['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [23]:
usuarios.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [66]:
usuarios.iloc[:,2]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Ej 12. ¿Cuántas ocupaciones diferentes hay en este conjunto de datos? ¿Cuántos usuarios por ocupación hay en el conjunto de datos?

In [28]:
usuarios['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [29]:
len(usuarios['occupation'].unique())

21

In [30]:
usuarios['occupation'].nunique()

21

In [74]:
diferentes=set()
for x in usuarios.occupation:
    diferentes.add(x)

print(diferentes)
print('Ocupaciones diferentes: ',len(diferentes))

{'educator', 'homemaker', 'marketing', 'artist', 'engineer', 'executive', 'doctor', 'healthcare', 'programmer', 'student', 'entertainment', 'other', 'administrator', 'none', 'scientist', 'lawyer', 'salesman', 'writer', 'retired', 'librarian', 'technician'}
Ocupaciones diferentes:  21

In [79]:
#Usuarios por ocupacion
dic={}

for x in diferentes:
    dic[x]=list(usuarios['occupation']).count(x)

dic

{'educator': 95,
 'homemaker': 7,
 'marketing': 26,
 'artist': 28,
 'engineer': 67,
 'executive': 32,
 'doctor': 7,
 'healthcare': 16,
 'programmer': 66,
 'student': 196,
 'entertainment': 18,
 'other': 105,
 'administrator': 79,
 'none': 9,
 'scientist': 31,
 'lawyer': 12,
 'salesman': 12,
 'writer': 45,
 'retired': 14,
 'librarian': 51,
 'technician': 27}

In [31]:
usuarios['occupation'].value_counts() #Te cuenta los valores de cada columna

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: count, dtype: int64

### Ej 13. ¿Cuál es la ocupación más frecuente?

In [4]:
usuarios

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [32]:
max(usuarios['occupation'].value_counts()) #Valor maximo de repeticiones KONTUZ

196

In [34]:
dif=usuarios['occupation'].value_counts()
print(dif.idxmax(),dif.max()) #idmax indica el estudiante con el valor maximo

student 196

In [85]:
print(max(dic.values()))

196

In [91]:
maximo=max(dic.values())

for clave, valor in dic.items():
    if valor==maximo:
        print(clave)

student

### Ej 14. Resuma el marco de datos.

In [104]:
resumen=usuarios.describe() #con .resume obtenemos el resumen de las columnas NUMERICAS
print(resumen)

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [37]:
usuarios

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [39]:
#PIDE ESTO
resumen=usuarios.groupby(['occupation']).count()
resumen

               age  gender  zip_code
occupation
administrator   79      79        79
artist          28      28        28
doctor           7       7         7
educator        95      95        95
engineer        67      67        67
entertainment   18      18        18
executive       32      32        32
healthcare      16      16        16
homemaker        7       7         7
lawyer          12      12        12
librarian       51      51        51
marketing       26      26        26
none             9       9         9
other          105     105       105
programmer      66      66        66
retired         14      14        14
salesman        12      12        12
scientist       31      31        31
student        196     196       196
technician      27      27        27
writer          45      45        45

### Ej 15. Resumir todas las columnas.

In [107]:
usuarios.info() #Resumen de todo el dataset

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

In [42]:
usuarios.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Ej 16. Resume solo la columna de ocupación.

In [40]:
usuarios.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [108]:
usuarios['occupation'].info()

<class 'pandas.core.series.Series'>
Index: 943 entries, 1 to 943
Series name: occupation
Non-Null Count  Dtype
--------------  -----
943 non-null    object
dtypes: object(1)
memory usage: 47.0+ KB

### Ej 17. ¿Cuál es la edad media de los usuarios?

In [92]:
usuarios

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [94]:
usuarios.age.mean()

34.05196182396607

In [45]:
usuarios['age'].mean()

34.05196182396607

### Ej 18. ¿Cuál es la edad de menor aparición?

In [49]:
usuarios['age'].value_counts().idxmin() #Primero value_counts para que lea todo
#valor minimo

7

In [51]:
usuarios['age'].idxmin()  #Posicion de la persona mas joven

30

In [95]:
edades=set()

for x in usuarios.age:
    edades.add(x)

print(edades)

{7, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 68, 69, 70, 73}

In [102]:
dic_edades={}

for x in edades:
    dic_edades[x]=list(usuarios['age']).count(x)

minimo=min(dic_edades.values())
for clave,valor in dic_edades.items():
    if valor==minimo:
        print(clave)

7
10
11
66
73